experiments/results/nulldev/fio_randwrite_8k_4_2.out
randwrite_8k_4_2: (g=0): rw=randwrite, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=io_uring, iodepth=4
...
fio-3.28
Starting 2 threads

randwrite_8k_4_2: (groupid=0, jobs=2): err= 0: pid=11199: Tue Feb 28 04:01:29 2023
  write: IOPS=103k, BW=803MiB/s (842MB/s)(47.0GiB/60001msec); 0 zone resets
    slat (usec): min=3, max=234, avg= 6.25, stdev= 1.72
    clat (nsec): min=564, max=1599.9k, avg=70971.25, stdev=20407.48
     lat (usec): min=40, max=1605, avg=77.30, stdev=20.61
    clat percentiles (usec):
     |  1.00th=[   40],  5.00th=[   41], 10.00th=[   48], 20.00th=[   58],
     | 30.00th=[   62], 40.00th=[   67], 50.00th=[   71], 60.00th=[   74],
     | 70.00th=[   77], 80.00th=[   80], 90.00th=[   89], 95.00th=[  117],
     | 99.00th=[  143], 99.50th=[  151], 99.90th=[  163], 99.95th=[  169],
     | 99.99th=[  186]
   bw (  KiB/s): min=787600, max=828800, per=100.00%, avg=822390.43, stdev=2200.04, samples=240
   iops        : min=98450, max=103600, avg=102798.72, stdev=275.00, samples=240
  lat (nsec)   : 750=0.01%
  lat (usec)   : 20=0.01%, 50=10.68%, 100=82.33%, 250=6.99%, 500=0.01%
  lat (usec)   : 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%
  cpu          : usr=7.56%, sys=37.64%, ctx=2872075, majf=0, minf=0
  IO depths    : 1=0.0%, 2=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,6166947,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4

Run status group 0 (all jobs):
  WRITE: bw=803MiB/s (842MB/s), 803MiB/s-803MiB/s (842MB/s-842MB/s), io=47.0GiB (50.5GB), run=60001-60001msec